IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/VTM0_MMR_VBUSP_CFG2.xml
<module name="VTM0_MMR_VBUSP_CFG2" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="MMR__VBUSP__CFG2_VTM_CLK_CTRL" acronym="MMR__VBUSP__CFG2_VTM_CLK_CTRL" offset="0x8" width="32" description="VTM clock related control MMR. The default reset values will not be necessarily overwritten. The write capability in the MMR is for having the option to debug and have software driven adjustments if necessary. The e-fuse value is sampled from input port efuse_tsens_clk_src_div. The tsens_clks_src_div field is Device specific.">
		<bitfield id="TSENS_CLK_SEL" width="1" begin="31" end="31" resetval="0x0" description="Temperature sensor clock source selector. Device specific. 0 = fix_ref_clk as source.  1 = fix_ref2_clk as source. Reset value is at POR only." range="31" rwaccess="R/W"/> 
		<bitfield id="TSENS_CLK_DIV" width="5" begin="4" end="0" resetval="0x0" description="Temperature sensor clock source divider selector. Device specific. Default set by e-fuse or tie-off. Divider uses select reference clock as source. 0 = 1x divide.  1 = 2x divide. ... 15 = 16x divide. ... 63 = 64x divide. Reset value is from e-fuse at POR, efuse_tsens_clk_src_div." range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="MMR__VBUSP__CFG2_VTM_MISC_CTRL" acronym="MMR__VBUSP__CFG2_VTM_MISC_CTRL" offset="0xC" width="32" description="VTM miscellaneous control bits.">
		<bitfield id="ANY_MAXT_OUTRG_ALERT_EN" width="1" begin="0" end="0" resetval="0x0" description="This bit when enabled will cause the VTM's output therm_maxtemp_outrange_alert to be driven high, if any of the sources for the maxt_outrg_alert, is set high. Whenever all the maxt_outrg_alert enabled sensor alerts, out of the 8 possible are back to 0 then the output, therm_maxtemp_outrange_alert, will also return to 0. Reset is at POR only." range="0" rwaccess="R/W"/>
	</register>
	<register id="MMR__VBUSP__CFG2_VTM_MISC_CTRL2" acronym="MMR__VBUSP__CFG2_VTM_MISC_CTRL2" offset="0x10" width="32" description="VTM miscellaneous control bits.">
		<bitfield id="MAXT_OUTRG_ALERT_THR0" width="10" begin="25" end="16" resetval="0x0" description="This defines the global max temperature out of range safe sample value. If the alert is enabled globally and for the sensor and the sensor reads a value &#60;= this value then the alert is cleared after being triggered. This safe threshold defines at what temp the alert can be cleared. Reset is at POR only." range="25 - 16" rwaccess="R/W"/> 
		<bitfield id="MAXT_OUTRG_ALERT_THR" width="10" begin="9" end="0" resetval="0x0" description="This defines the global max temperature out of range sample value. If the alert is enabled globally and for the sensor and the sensor reads a value >= this value then the alert is triggered. Reset is at POR only." range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="MMR__VBUSP__CFG2_VTM_SAMPLE_CTRL" acronym="MMR__VBUSP__CFG2_VTM_SAMPLE_CTRL" offset="0x20" width="32" description="VTM sample related control MMR. The default reset values will not be necessarily overwritten. The write capability in the MMR is for having the option to debug and have software driven adjustments if necessary. The e-fuse value is sampled from input port efuse_sample_clk_cnt. The sample_clk_cnt field is Device specific.">
		<bitfield id="SAMPLE_PER_CNT" width="16" begin="15" end="0" resetval="0x0" description="Temperature sensor sample period count selector. Device specific. Default set by e-fuse or tie-off. This defines the sample period or number of sensor clocks between consecutive samples of the sensor allowed, from the start of the previous sample request to the start of the next sample request. After the sample is received the sensor status MMR fields will not be updated and the sensor will remain disabled. Reset value is from e-fuse at POR, efuse_sample_per_cnt." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="MMR__VBUSP__CFG2_CTRL" acronym="MMR__VBUSP__CFG2_CTRL" offset="0x300" width="32" description="Temperature Sensor Band-gap control register for sensor a.">
		<bitfield id="MAXT_OUTRG_EN" width="1" begin="11" end="11" resetval="0x0" description="Enable out-of-range event. This bit enables generation of the alert in case the given temperature sensors generates a temp code above a programmed max. 0 = Don't generate alert. 1 = Generate alert. Reset value is POR only." range="11" rwaccess="R/W"/> 
		<bitfield id="CLRZ" width="1" begin="6" end="6" resetval="0x1" description="Temp-Monitor control: 0 = Reset all Temp-monitor digital outputs. 1 = Allow operation of sensor. Reset value is POR only." range="6" rwaccess="R/W"/> 
		<bitfield id="SOC" width="1" begin="5" end="5" resetval="0x0" description="Temp-Monitor control: ADC Start of Conversion. A transition from 0 to 1 starts a new ADC conversion cycle. The bit with automatically clear when the conversion has completed. This mode is not valid when already in continuous mode. Reset value is POR only." range="5" rwaccess="R/W"/> 
		<bitfield id="CONT" width="1" begin="4" end="4" resetval="0x0" description="Temp-Monitor control: ADC Continuous mode. Setting this mode enables the VTM to continuously monitor the sensor automatically. Each sample period the sensor will be accessed and the results captured. Reset value is POR only." range="4" rwaccess="R/W"/>
	</register>
	<register id="MMR__VBUSP__CFG2_TRIM" acronym="MMR__VBUSP__CFG2_TRIM" offset="0x304" width="32" description="Temperature Sensor Band-gap trim values register for sensor a. The default reset values will not be necessarily overwritten. The write capability in the MMR is for having the option to debug and have software driven adjustments if necessary.">
		<bitfield id="TRIMO" width="6" begin="13" end="8" resetval="0x0" description="Trim offset bits in the temp sensor. Reset value is from e-fuse at POR, efuse_tmpsens[a]_trimo." range="13 - 8" rwaccess="R/W"/> 
		<bitfield id="TRIMG" width="5" begin="4" end="0" resetval="0x0" description="Trim gain bits in the temp sensor. Reset value is from e-fuse at POR, efuse_tmpsens[a]_trimg." range="4 - 0" rwaccess="R/W"/>
	</register>
</module>